/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Button title to choose an Address Book card for a contact */
"Choose Address Book Card" = "Valitse Osoitekirja kortti";

/* No comment provided by engineer. */
"Choose Card" = "Valitse kortti";

/* No comment provided by engineer. */
"Close" = "Sulje";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* Verb 'edit' on a button */
"Edit" = "Muokkaa";

/* 'Get Info' on a button; when pressed, the information for a specified contact will be displayed */
"Get Info" = "Näytä tietoja";

/* Button in the Xtras Manager to go to adiumxtras.com to get more adiumxtras */
"Get More Xtras" = "Hae lisää ekstroja";

/* No comment provided by engineer. */
"Invite" = "Kutsu";

/* Button title to open a message window the specific contact from the 'New Chat' window */
"Message" = "Viesti";

/* Verb 'OK' on a button */
"OK" = "OK";

/* Button to return from away in the away status window */
"Return" = "Kumoa";

/* No comment provided by engineer. */
"Send" = "Lähetä";